// تسابيح - General Adhkar (Tasbeeh)

export const generalAdhkar = [
  {
    title: "سبحان الله",
    arabic: "سُبْحَانَ اللَّهِ.",
    repetition: " ",
    why: "يكتب له ألف حسنة أو يحط عنه ألف خطيئة.",
  },
  {
    title: "سبحان الله والحمد لله",
    arabic: "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ.",
    repetition: "100 مرة",
    why: "غفرت خطاياه، وإن كانت مثل زبد البحر",
  },
  {
    title: "سبحان الله العظيم وبحمده",
    arabic: "سُبْحَانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ.",
    repetition: " ",
    why: "غرست له نخلة في الجنة.",
  },
  {
    title: "سبحان الله وبحمده سبحان الله العظيم",
    arabic: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيمِ.",
    repetition: " ",
    why: "ثقيلتان في الميزان حبيبتان إلى الرحمن.",
  },
  {
    title: "لا إله إلا الله وحده لا شريك له",
    arabic:
      "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
    repetition: "100 مرة",
    why: "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.",
  },
  {
    title: "لا حول ولا قوة إلا بالله",
    arabic: "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ.",
    repetition: " ",
    why: "كنز من كنوز الجنة.",
  },
  {
    title: "وسُبحانَ اللهِ والحمدُ للهِ",
    arabic: "وسُبحانَ اللهِ والحمدُ للهِ",
    repetition: " ",
    why: "...الطُّهورُ شطْرُ الإيمانِ ، والحمدُ للهِ تملأُ الميزانَ ، وسُبحانَ اللهِ والحمدُ للهِ تَملآنِ ما بين السماءِ والأرضِ",
  },
  {
    title: "اللهم صل وسلم وبارك على سيدنا محمد",
    arabic: "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ.",
    repetition: " ",
    why: "من الأذكار العظيمة  ",
  },
  {
    title: "أستغفر الله",
    arabic: "أَسْتَغْفِرُ اللَّهَ.",
    repetition: " ",
    why: "لفعل الرسول صلى الله عليه وسلم.",
  },
  {
    title: "الباقيات الصالحات",
    arabic:
      "سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ.",
    repetition: " ",
    why: "أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والباقيات الصالحات.",
  },
  {
    title: "لا إله إلا الله",
    arabic: "لَا إِلَهَ إِلَّا اللَّهُ.",
    repetition: " ",
    why: "أفضل الذكر لا إله إلا الله.",
  },
  {
    title: "الدعاء دعاء يوم عرفة",
    arabic:
      "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير",
    repetition: " ",
    why: "  روي عن النبي ﷺ وخير ما قلت أنا والنبيون من قبلي",
  },
  {
    title: "الله أكبر",
    arabic: "اللَّهُ أَكْبَرُ.",
    repetition: " ",
    why: "من الأذكار العظيمة  ",
  },
  {
    title: "خير الدنيا والآخرة",
    arabic:
      "سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ، اللَّهُمَّ اغْفِرْ لِي، اللَّهُمَّ ارْحَمْنِي، اللَّهُمَّ ارْزُقْنِي.",
    repetition: " ",
    why: " من الأذكار العظيمة ",
  },
  {
    title: "الحمد لله حمدا كثيرا طيبا مباركا فيه",
    arabic: "الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ.",
    repetition: " ",
    why: "قال النبي صلى الله عليه وسلم: لقد رأيت اثني عشر ملكا يبتدرونها، أيهم يرفعها.",
  },
  {
    title: "الله أكبر كبيرا والحمد لله كثيرا",
    arabic:
      "اللَّهُ أَكْبَرُ كَبِيرًا، وَالْحَمْدُ لِلَّهِ كَثِيرًا، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلًا.",
    repetition: " ",
    why: " ",
  },
  {
    title: "الصلاة الإبراهيمية",
    arabic:
      "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.",
    repetition: "100 مرة",
    why: " ",
  },
  {
    title: "سبحان الله  ",
    arabic: "سُبْحَانَ اللَّهِ.",
    repetition: " ",
    why: " من الأذكار العظيمة ",
  },
  {
    title: "الحمد لله ",
    arabic: "الْحَمْدُ لِلَّهِ.",
    repetition: " ",
    why: " من الأذكار العظيمة ",
  },
  {
    title: "لا إله إلا الله ",
    arabic:
      "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
    repetition: "10 مرات",
    why: "مَنْ قالَ لا إلهَ إلاَّ اللَّه وحْدهُ لاَ شَرِيكَ لهُ، لَهُ المُلْكُ، ولَهُ الحمْدُ، وَهُو عَلَى كُلِّ شَيءٍ قَدِيرٌ، عشْر مرَّاتٍ، كَانَ كَمَنْ أَعْتَقَ أرْبعةَ أَنفُسٍ مِن وَلدِ إسْماعِيلَ",
  },
  {
    title: "سبحان الله وبحمده  ",
    arabic: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ.",
    repetition: "100 مرة",
    why: "من قالها في يوم مائة مرة حطت خطاياه وإن كانت مثل زبد البحر.",
  },
  {
    title: "الله أكبر  ",
    arabic: "اللَّهُ أَكْبَرُ.",
    repetition: "",
    why: "من الأذكار العظيمة ",
  },
  {
    title: "أستغفر الله وأتوب إليه ",
    arabic: "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ.",
    repetition: "100 مرة",
    why: "الاستغفار من أعظم الأذكار .",
  },
];

export const joamiaAdhkar = [
  {
    title: "من جوامع الدعاء",
    arabic:
      "اللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ.",
    repetition: " ",
    why: "قال أنس رضي الله عنه: كان أكثر دعاء النبي ﷺ: «اللهم ربنا آتنا في الدنيا حسنة...» رواه البخاري ومسلم.",
  },
  {
    title: "من جوامع الدعاء",
    arabic:
      "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى، وَالْعَفَافَ وَالْغِنَى.",
    repetition: " ",
    why: "رواه البخاري ومسلم",
  },
  {
    title: "من جوامع الدعاء",
    arabic: "لا إلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ منَ الظَّالِمينَ",
    repetition: " ",
    why: "عن سعد بن أبي وقاص رضي الله عنه أن النبي ﷺ قال: «دعوة ذي النون إذ دعاه وهو في بطن الحوت... فإنه لم يدع بها رجل مسلم في شيء قط؛ إلا استجاب الله له»",
  },
  {
    title: "من جوامع الدعاء",
    arabic: "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَعَافِني، وَ ارْزُقنِي",
    repetition: " ",
    why: "عن أبي مالك الأشجعي رضي الله عنه أن النبي ﷺ قال: «اللهم اغفر لي... فإن هؤلاء تجمع لك دنياك وآخرتك» رواه مسلم",
  },
  {
    title: "من جوامع الدعاء",
    arabic: "اللَّهُمَّ أَعنَّا عَلَى شُكْركَ، وذكركَ، وَحُسْنِ عِبَادَتِكَ",
    repetition: " ",
    why: "عن أبي هريرة رضي الله عنه أن النبي ﷺ قال: «أتحبون أن تجتهدوا في الدعاء؟ قولوا: اللهم أعنا...».",
  },
  {
    title: "من جوامع الدعاء",
    arabic: "اللَّهُمَّ إِنِّي أَسْأَلُكَ المُعَافَاةَ في الدُّنيا والآخرة",
    repetition: " ",
    why: "عن أبي هريرة أن النبي ﷺ قال: «ما من دعوة يدعو بها العبد أفضل من: اللهم إني أسألك المعافاة...».",
  },

  {
    title: "من جوامع الدعاء",
    arabic:
      "اللَّهُمَّ أَصْلِحْ لي ديني الَّذِي هُوَ عصْمَةُ أمْرِي، وَأَصْلِحْ لي دُنْيَايَ التي فيها معاشي، وأصلح لي آخرتي التي فيها معادي، وَاجْعَل الحَيَاةَ زيادَةً لي في كُلِّ خَيرِ، وَاجْعَلِ المَوْتَ رَاحَةً لِي منْ كُلِّ شَرٍّ",
    repetition: " ",
    why: "عن أبي هريرة أن النبي ﷺ قال: «اللهم أصلح لي ديني...» رواه مسلم",
  },
  {
    title: "من جوامع الدعاء",
    arabic:
      "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى، وَالْعَفَافَ وَالْغِنَى.",
    repetition: " ",
    why: "عن عبد الله بن مسعود رضي الله عنه عن النبي ﷺ أنه كان يقول: «اللهم إني أسألك الهدى...» رواه مسلم",
  },
  {
    title: "من جوامع الدعاء",
    arabic: "اللهم اغفر لي ذنبي كله، دقه وجله، وأوله وآخره، وعلانيته وسره",
    repetition: " ",
    why: "من دعاء النبي ﷺ،",
  },
  {
    title: "من جوامع الدعاء",
    arabic: "يا مُقلّب القُلُوب ثبِّتْ قَلْبِي عَلَى دِينِكَ",
    repetition: " ",
    why: "قالت أم سلمة رضي الله عنها: كان أكثر دعائه ﷺ: «يا مقلب القلوب...»",
  },
  {
    title: "من جوامع الدعاء",
    arabic:
      "اللَّهُمَّ اكْفني بِحَلالِكَ عَنْ حَرَامِكَ، وأغنني بفَضْلِكَ عَمَّنْ سِوَاكَ",
    repetition: " ",
    why: "عن علي رضي الله عنه أن النبي ﷺ قال له: «ألا أعلمك كلمات، لو كان عليك مثل جبل صبير ديناً أداه الله عنك؟ قل: اللهم اكفني...»",
  },
];
